configs/runs/hidden_bench/hidden_bench_grid.yaml
# HiddenBench grid: profile x n_agents x assignment_scheme x rounds.
#
# The base section below is deliberately a valid single-run config on its own -
# delete `grid:` and it loads and runs. That is the convention in
# configs/runs/old/naming_convention_grid_tutorial_university_v3.yaml and the
# reason a grid config stays readable.
#
# WHY THESE FOUR AXES, IN THIS ORDER:
#   profile:           hidden vs full is the paper's headline contrast. The
#                      `full` cells are what `gap_to_full = y_post - y_full`
#                      is resolved against in analysis - the game deliberately
#                      does not compute it, because it needs the paired cell.
#   n_agents:          the group-size collapse (+0.348 -> +0.006 in the paper).
#   assignment_scheme: bijective only exists at N == C, so N=4 uses it and the
#                      larger cells use exact_replication. The cartesian product
#                      therefore contains invalid combinations, which is
#                      intentional - see the note under `grid:` below.
#   rounds:            communication depth T (the paper peaks at 15, declines
#                      at 20); 0 is the no-discussion cell that yields Y_full.
#
# CELL COUNT: 2 x 3 x 1 x 2 = 12 cells x 2 repetitions = 24 episodes.
# All cells share ONE budget guard and one concurrency pool, so `budget:` below
# is sized for the whole grid, not for one cell. Check with
#   mas-cc experiment preflight --config configs/runs/hidden_bench_grid.yaml
# which refuses to launch anything it cannot price.
llm_provider:
  type: university
  model: gwdg/qwen3-30b-a3b-instruct-2507
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  timeout_seconds: 60
  max_retries: 2
  request_concurrency: 8
  temperature: 0.0
  max_output_tokens: 512
  options:
    estimated_latency_seconds: 3.0
prompt:
  schema_version: 2
  prompt_family: hidden_bench_vote
  prompt_version: 1
  message_mode: merge_consecutive_roles
  block_separator: "\n\n"
  response_contract:
    type: hidden_bench_json_vote
    allowed_values: [West City, East Town, North Hill]
game:
  type: hidden_bench_vanilla
  population_size: 4
  horizon: 42
  topology: complete
  options:
    task_set: vanilla
    task_id: evacuation_west_city
    # `n_agents` is deliberately NOT set here: it defaults to
    # game.population_size, which is what the grid sweeps. Setting both and
    # sweeping only one is rejected at initialize rather than silently building
    # a population of a different size than preflight priced.
    profile: hidden
    assignment_scheme: exact_replication
    rounds: 3
    rounds_are_speaking_turns: false
    extra_prompt: null
    dissenter_extra_prompt: null
    dissenter_fraction: 0.0
    aggregation: average
    shuffle_facts: true
    decoy: null
    invalid_response_retries: 2
    expected_validation_failure_rate: 0.0
control:
  mechanism: none
execution:
  seed: 20260805
  repetitions: 2 # episodes PER CELL, not in total
  parallelism: 4
  fail_fast: false
pricing:
  mode: live
  max_age_seconds: 600
  require_fresh_at_launch: true
  fallback_policy: deny
  explicit_unknown_price_override: false
budget:
  # Worst cell is profile=hidden, n_agents=6, rounds=3 -> 6 + 18*... see
  # preflight; the ceiling below is the whole grid's conservative demand with
  # retries. It is enforced, not advisory: the grid fails closed before spending.
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 8.0
  max_cost_per_run: 8.0
  max_provider_requests: 3000
  max_input_tokens: 8000000
  max_output_tokens: 1200000
  allow_unbounded_paid_requests: false
logging:
  level: INFO
  console: true
  audit: true
  comet: false
  options:
    prompt_examples:
      count: 1
storage:
  output_dir: results
  format: jsonl
  checkpoints: true
  overwrite: false
analysis:
  enabled: false
  estimators: []
metrics:
  enabled: true
  available:
    population_action_share_per_option:
      comet: true
    dominant_action_share:
      comet: true
    accuracy_average:
      comet: true
    accuracy_majority:
      comet: true
    decoy_share:
      comet: true
    unshared_disclosure_rate:
      comet: true
    y_pre:
      comet: true
    y_post:
      comet: true
    improvement:
      comet: true
    final_unshared_disclosure_rate:
      comet: true
    first_consensus_time_by_action_share:
      comet: false
    agent_current_action:
      comet: false
experiment:
  name: hidden-bench-profile-groupsize-depth
  description: HiddenBench sweep over profile x group size x communication depth; the `full` cells supply Y_full for gap_to_full.
  tags: [hidden-bench, grid, hidden-profile, group-size]
grid:
  # `rounds: 0` is the no-discussion cell. Paired with `profile: full` it is
  # exactly how Y_full is measured; paired with `profile: hidden` it is the
  # Y_pre baseline and the cell from which the modal wrong option (the decoy)
  # is derived in analysis.
  game.options.profile: [hidden, full]
  game.population_size: [4, 5, 6]
  game.options.rounds: [0, 3]